app/controllers/thoughts_controller.rb

SELECT "thoughts".* FROM "thoughts"
---
  def index
    @thoughts = Thought.all

INSERT INTO "thoughts" ("title", "body", "distress_level", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @thought = Thought.new(thought_params)

    respond_to do |format|
      if @thought.save

SELECT  "thoughts".* FROM "thoughts" WHERE "thoughts"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_thought
      @thought = Thought.find(params[:id])